// フィボナッチ数列の高速化（漸化式）
void mult(long A[2][2], long B[2][2], long C[2][2]) {
    long c00 = A[0][0] * B[0][0] + A[0][1] * B[1][0];
    long c10 = A[1][0] * B[0][0] + A[1][1] * B[1][0];
    long c01 = A[0][0] * B[0][1] + A[0][1] * B[1][1];
    long c11 = A[1][0] * B[0][1] + A[1][1] * B[1][1];
    C[0][0] = c00; C[1][0] = c10; C[0][1] = c01; C[1][1] = c11;
}

long h(int n) {
    long X[2][2] = {{1, 1}, {1, 0}};
    long Y[2][2] = {{1, 0}, {0, 1}};
    while (n > 0) {
        if (n % 2 == 1) mult(Y, X, Y); //（C）
        mult(X, X, X); //（d）
        n /= 2;
    }
    return Y[1][0];
}
